interface Select {
  label: string;
  value: string;
}
export type Department = Select[];
export type Faculty = Array<Select & { departments: Select[] }>;

export const faculties: Faculty = [
  {
    label: 'คณะวิศวกรรมศาสตร์',
    value: 'คณะวิศวกรรมศาสตร์',
    departments: [
      {
        label: 'วิศวกรรมคอมพิวเตอร์',
        value: 'วิศวกรรมคอมพิวเตอร์',
      },
      {
        label: 'วิศวกรรมไฟฟ้า',
        value: 'วิศวกรรมไฟฟ้า',
      },
      {
        label: 'วิศวกรรมอิเล็กทรอนิกส์และโทรคมนาคม',
        value: 'วิศวกรรมอิเล็กทรอนิกส์และโทรคมนาคม',
      },
      {
        label: 'วิศวกรรมระบบควบคุมและเครื่องมือวัด',
        value: 'วิศวกรรมระบบควบคุมและเครื่องมือวัด',
      },
      {
        label: 'วิศวกรรมเครื่องกล',
        value: 'วิศวกรรมเครื่องกล',
      },
      {
        label: 'วิศวกรรมโยธา',
        value: 'วิศวกรรมโยธา',
      },
      {
        label: 'วิศวกรรมสิ่งแวดล้อม',
        value: 'วิศวกรรมสิ่งแวดล้อม',
      },
      {
        label: 'วิศวกรรมอุตสาหการ',
        value: 'วิศวกรรมอุตสาหการ',
      },
      {
        label: 'วิศวกรรมเครื่องมือและวัสดุ',
        value: 'วิศวกรรมเครื่องมือและวัสดุ',
      },
      {
        label: 'วิศวกรรมเคมี',
        value: 'วิศวกรรมเคมี',
      },
      {
        label: 'วิศวกรรมอาหาร',
        value: 'วิศวกรรมอาหาร',
      },
      {
        label: 'หลักสูตรวิศวกรรมชีวภาพ',
        value: 'หลักสูตรวิศวกรรมชีวภาพ',
      },
      {
        label: 'หลักสูตรวาริชวิศวกรรม',
        value: 'หลักสูตรวาริชวิศวกรรม',
      },
    ],
  },
  {
    label: 'คณะวิทยาศาสตร์',
    value: 'คณะวิทยาศาสตร์',
    departments: [
      {
        label: 'เคมี',
        value: 'เคมี',
      },
      {
        label: 'คณิตศาสตร์',
        value: 'คณิตศาสตร์',
      },
      {
        label: 'จุลชีววิทยา',
        value: 'จุลชีววิทยา',
      },
      {
        label: 'ฟิสิกส์',
        value: 'ฟิสิกส์',
      },
    ],
  },
  {
    label: 'คณะครุศาสตร์อุตสาหกรรมและเทคโนโลยี',
    value: 'คณะครุศาสตร์อุตสาหกรรมและเทคโนโลยี',
    departments: [
      {
        label: 'ครุศาสตร์โยธา',
        value: 'ครุศาสตร์โยธา',
      },
      {
        label: 'ครุศาสตร์ไฟฟ้า',
        value: 'ครุศาสตร์ไฟฟ้า',
      },
      {
        label: 'ครุศาสตร์เครื่องกล',
        value: 'ครุศาสตร์เครื่องกล',
      },
      {
        label: 'ครุศาสตร์อุตสาหการ',
        value: 'ครุศาสตร์อุตสาหการ',
      },
      {
        label: 'เทคโนโลยีและสื่อสารการศึกษา',
        value: 'เทคโนโลยีและสื่อสารการศึกษา',
      },
      {
        label: 'คอมพิวเตอร์และเทคโนโลยีสารสนเทศ',
        value: 'คอมพิวเตอร์และเทคโนโลยีสารสนเทศ',
      },
      {
        label: 'เทคโนโลยีการพิมพ์และบรรจุภัณฑ์',
        value: 'เทคโนโลยีการพิมพ์และบรรจุภัณฑ์',
      },
    ],
  },
  {
    label: 'สถาบันวิทยาการหุ่นยนต์ภาคสนาม (FIBO)',
    value: 'สถาบันวิทยาการหุ่นยนต์ภาคสนาม (FIBO)',
    departments: [
      {
        label: 'สถาบันวิทยาการหุ่นยนต์ภาคสนาม (FIBO)',
        value: 'สถาบันวิทยาการหุ่นยนต์ภาคสนาม (FIBO)',
      },
    ],
  },
  {
    label: 'คณะสถาปัตยกรรมศาสตร์และการออกแบบ',
    value: 'คณะสถาปัตยกรรมศาสตร์และการออกแบบ',
    departments: [
      {
        label: 'โครงการร่วมบริหารหลักสูตรฯ (มีเดีย)',
        value: 'โครงการร่วมบริหารหลักสูตรฯ (มีเดีย)',
      },
    ],
  },
  {
    label: 'คณะเทคโนโลยีสารสนเทศ',
    value: 'คณะเทคโนโลยีสารสนเทศ',
    departments: [
      {
        label: 'เทคโนโลยีสารสนเทศ',
        value: 'เทคโนโลยีสารสนเทศ',
      },
    ],
  },
  {
    label: 'คณะศิลปศาสตร์',
    value: 'คณะศิลปศาสตร์',
    departments: [
      {
        label: 'สำนักงานวิชาศึกษาทั่วไป',
        value: 'สำนักงานวิชาศึกษาทั่วไป',
      },
    ],
  },
  {
    label: 'คณะพลังงานสิ่งแวดล้อมและวัสดุ',
    value: 'คณะพลังงานสิ่งแวดล้อมและวัสดุ',
    departments: [
      {
        label: 'เทคโนโลยีพลังงาน',
        value: 'เทคโนโลยีพลังงาน',
      },
      {
        label: 'เทคโนโลยีการจัดการพลังงาน',
        value: 'เทคโนโลยีการจัดการพลังงาน',
      },
      {
        label: 'เทคโนโลยีวัสดุ',
        value: 'เทคโนโลยีวัสดุ',
      },
      {
        label: 'เทคโนโลยีสิ่งแวดล้อม',
        value: 'เทคโนโลยีสิ่งแวดล้อม',
      },
      {
        label: 'เทคโนโลยีอุณหภาพ',
        value: 'เทคโนโลยีอุณหภาพ',
      },
      {
        label: 'กลุ่มวิจัยการผลิตและขึ้นรูปพอลิเมอร์',
        value: 'กลุ่มวิจัยการผลิตและขึ้นรูปพอลิเมอร์',
      },
      {
        label: 'กลุ่มงานวิจัยเพื่อการอนุรักษ์พลังงาน (EnConLab)',
        value: 'กลุ่มงานวิจัยเพื่อการอนุรักษ์พลังงาน (EnConLab)',
      },
      {
        label: 'ศูนย์ดัชนีการอ้างอิงวารสารไทย (TCI)',
        value: 'ศูนย์ดัชนีการอ้างอิงวารสารไทย (TCI)',
      },
    ],
  },
  {
    label: 'คณะทรัพยากรชีวภาพและเทคโนโลยี',
    value: 'คณะทรัพยากรชีวภาพและเทคโนโลยี',
    departments: [
      {
        label: 'เทคโนโลยีชีวภาพ',
        value: 'เทคโนโลยีชีวภาพ',
      },
      {
        label: 'เทคโนโลยีชีวเคมี',
        value: 'เทคโนโลยีชีวเคมี',
      },
      {
        label: 'เทคโนโลยีหลังการเก็บเกี่ยว',
        value: 'เทคโนโลยีหลังการเก็บเกี่ยว',
      },
      {
        label: 'การจัดการทรัพยากรชีวภาพ',
        value: 'การจัดการทรัพยากรชีวภาพ',
      },
      {
        label: 'หลักสูตรชีวสารสนเทศและชีววิทยาระบบ',
        value: 'หลักสูตรชีวสารสนเทศและชีววิทยาระบบ',
      },
      {
        label: 'กลุ่มทักษะการจัดการทรัพยากรฐานชุมชน',
        value: 'กลุ่มทักษะการจัดการทรัพยากรฐานชุมชน',
      },
    ],
  },
  {
    label: 'บัณฑิตวิทยาลัยการจัดการและนวัตกรรม',
    value: 'บัณฑิตวิทยาลัยการจัดการและนวัตกรรม',
    departments: [
      {
        label: 'บัณฑิตวิทยาลัยการจัดการและนวัตกรรม',
        value: 'บัณฑิตวิทยาลัยการจัดการและนวัตกรรม',
      },
    ],
  },
];
